Netology/src/DataProcessors/ЗагрузкаПрайсаИзФайлаXlsx/ЗагрузкаПрайсаИзФайлаXlsx.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПрайсаИзФайлаXlsx</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Netology/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/DataProcessors/ЗагрузкаПрайсаИзФайлаXlsx/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьФайлАсинхронно();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для загрузки данных";
	Диалог.Фильтр = "Excel-файлы|*.xlsx";

	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();

	Если РезультатВыбора = Неопределено Тогда

		Возврат;
		
	КонецЕсли;

	Объект.ПутьКФайлу = РезультатВыбора[0];
                       
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда  
		
		Возврат;
		
	КонецЕсли;  
	
	ЗагрузитьФайл();
	
КонецПроцедуры  

&НаКлиенте
Асинх Процедура ЗагрузитьФайл()                                                                                           

	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(, , , Объект.ПутьКФайлу, УникальныйИдентификатор); 
	ВсяНоменклатура = ПоискНоменклатуры(ОписаниеФайла.Адрес); 
	
	Если ВсяНоменклатура[0] = Ложь Тогда
	
		ТекстВопроса = "Не вся номенклатура найдена. Выберите действие с такой номенклатурой";      
		ВариантОтвета = Новый СписокЗначений;
		ВариантОтвета.Вставить(0, 0, "Не создавать документ");
		ВариантОтвета.Вставить(1, 1, "Не загружать номенклатуру");
		ВариантОтвета.Вставить(2, 2, "Создавать номенклатуру");      
		
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, ВариантОтвета);  
	
	КонецЕсли;  
	
	Если ОтветПользователя = 0 Тогда
		
			Возврат;      
			
	КонецЕсли;	
	
	СоздатьДокумент(Объект.Контрагент, Согласовано, ВсяНоменклатура, ОтветПользователя);	

КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПоискНоменклатуры(АдресФайла)
	
	РезультатПоиска = Новый Массив;
	РезультатПоиска.Вставить(0, Истина);         

	Данные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Данные.Записать(ИмяПромежуточногоФайла);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяПромежуточногоФайла);             
   
	Для Сч = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 

		ИмяНоменклатуры = ТабличныйДокумент.Область(Сч, 1).Текст;
		Цена = ТабличныйДокумент.Область(Сч, 2).Текст;		

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ИмяНоменклатуры); 
		
		НоваяНоменклатура = Новый Структура;
        НоваяНоменклатура.Вставить("ИмяНоменклатуры", ИмяНоменклатуры);
		НоваяНоменклатура.Вставить("Цена", Цена); 
 	
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			
			РезультатПоиска.Установить(0, Ложь);
			НоваяНоменклатура.Вставить("Найдена", Ложь);     
			
		Иначе 
			
			НоваяНоменклатура.Вставить("Найдена", Истина);
			
		КонецЕсли;
		
		РезультатПоиска.Добавить(НоваяНоменклатура);
		
	КонецЦикла; 
	
	УдалитьФайлы(ИмяПромежуточногоФайла);
	
	Возврат РезультатПоиска; 
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Контрагент, Согласовано, РезультатПоиска, ОтветПользователя)
	
	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();   
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Контрагент;
	ДокументЦены.Комментарий = "Загружен из файла"; 
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
		
	ЗаписываемаяНоменклатура = Новый Структура;
	Для Индекс = 1 По РезультатПоиска.ВГраница() Цикл
		
		ЗаписываемаяНоменклатура = РезультатПоиска[Индекс];	 
		
		Если ЗаписываемаяНоменклатура.Найдена = Ложь и ОтветПользователя = 1 Тогда

			Продолжить;  
			
		ИначеЕсли ЗаписываемаяНоменклатура.Найдена = Ложь и ОтветПользователя = 2 Тогда
			
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();        
			НоваяНоменклатура.Наименование = ЗаписываемаяНоменклатура.ИмяНоменклатуры;
			НоваяНоменклатура.Записать();
			
			Номенклатура = НоваяНоменклатура.Ссылка;

		КонецЕсли; 
		
		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		НоваяСтрокаТЧ.Цена = ОписаниеТипаЧисло.ПривестиЗначение(ЗаписываемаяНоменклатура.Цена);
		
	КонецЦикла;
	
	Если Не Согласовано Тогда
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Запись);
		
	Иначе
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;		 
	
КонецПроцедуры
